{
    "title": "Lights Out Management (LOM) (com.apple.lom)",
    "description": "The payload that configures lights-out management (LOM) settings.",
    "properties": {
        "ControllerCACertificateUUIDs": {
            "type": "array",
            "items": {
                "type": "string",
                "title": "UUID"
            },
            "title": "CA certificate payload UUIDs",
            "description": "An array of payload UUIDs containing CA certificates that devices use to evaluate trust of controller certificates.\n\nThis key configures the device to accept the 'LOMDeviceRequestCommand' from MDM and then send it to the target device. This certificate must contain the Key Usage attributes of Digital Signature, Key Encipherment and Data Encipherment. As well as the Extended Key Usage attributes of Server Authentication and Client Authentication.",
            "property_order": 5
        },
        "ControllerCertificateUUID": {
            "type": "string",
            "title": "Controller Certificate payload UUID",
            "description": "The UUID certificate for the LOM controller. This key configures the device to accept the 'LOMDeviceRequestCommand' from MDM and then send it to the target device.",
            "property_order": 10
        },
        "DeviceCACertificateUUIDs": {
            "type": "array",
            "items": {
                "type": "string"
            },
            "title": "CA certificate payload UUIDs",
            "description": "An array of payload UUIDs containing CA certificates that controllers use to evaluate trust of device certificates.",
            "property_order": 15
        },
        "DeviceCertificateUUID": {
            "type": "string",
            "title": "Device Certificate payload UUID",
            "description": "The UUID certificate for the device. This key indicates the device can receive 'PowerON', 'PowerOFF', and 'Reset' requests from a LOM controller. This certificate must contain the Key Usage attributes of Digital Signature, Key Encipherment and Data Encipherment. As well as the Extended Key Usage attributes of Server Authentication and Client Authentication.",
            "property_order": 20
        }
    }
}