{
    "title": "Global HTTP Proxy (com.apple.proxy.http.global)",
    "description": "Global HTTP Proxy settings",
    "properties": {
        "ProxyType": {
            "type": "string",
            "title": "Proxy Type",
            "default": "Manual",
            "description": "The proxy type. For a manual proxy type, the profile contains the proxy server address, including its port, and optionally a user name and password. For an auto proxy type, you can enter a PAC URL.",
            "enum": [
                "Manual",
                "Auto"
            ],
            "property_order": 5
        },
        "ProxyServer": {
            "type": "string",
            "title": "Proxy Server",
            "description": "The proxy server's network address. This is required if the ProxyType is set to Manual, and is ignored if the ProxyType is set to Automatic.",
            "property_order": 10
        },
        "ProxyServerPort": {
            "type": "integer",
            "title": "Proxy Server Port",
            "description": "The proxy server's port number. This is required if the ProxyType is set to Manual, and is ignored if the ProxyType is set to Automatic.",
            "property_order": 15
        },
        "ProxyUsername": {
            "type": "string",
            "title": "Proxy Username",
            "description": "The user name used to authenticate to the proxy server. This setting is only used if the ProxyType is set to Manual, and is ignored if the ProxyType is set to Automatic.",
            "property_order": 20
        },
        "ProxyPassword": {
            "type": "string",
            "title": "Proxy Password",
            "description": "The password used to authenticate to the proxy server. This setting is only used if the ProxyType is set to Manual, and is ignored if the ProxyType is set to Automatic.",
            "property_order": 25
        },
        "ProxyPACURL": {
            "type": "string",
            "title": "Proxy PAC URL",
            "description": "The URL of the PAC file that defines the proxy configuration. Starting in iOS 13 and macOS 10.15, only URLs that begin with 'http://' or 'https://' are allowed. This setting is only used if the ProxyType is set to Automatic, and is ignored if the ProxyType is set to Manual.",
            "pattern": "^https?://.*",
            "property_order": 30
        },
        "ProxyPACFallbackAllowed": {
            "type": "boolean",
            "title": "Proxy PAC Fallback Allowed",
            "default": false,
            "description": "If 'true', allows connecting directly to the destination if the proxy autoconfiguration (PAC) file is unreachable.",
            "property_order": 35
        },
        "ProxyCaptiveLoginAllowed": {
            "type": "boolean",
            "title": "Allow Proxy Bypass for Captive Portal Logins",
            "default": false,
            "description": "If 'true', allows the device to bypass the proxy server to display the login page for captive networks.",
            "property_order": 40
        }
    }
}